<a href="https://colab.research.google.com/github/p-cuadros/curso_python/blob/master/s2lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [2]:
pd.read_csv('s2ejemplo.csv')

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [0]:
df = pd.read_csv('s2ejemplo.csv')

In [0]:
df.to_csv('salida.csv',index=False)

In [6]:
pd.read_csv('salida.csv')

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [0]:
df = pd.read_excel('s2excel.xlsx',sheet_name='Hoja1')

In [0]:
df.to_excel('salida.xlsx',sheet_name='Hoja1',index=False)

<h1><b>Probando con Dataset de Kaggle

In [0]:
salario = pd.read_csv('s2salarios.csv')

In [11]:
salario.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [12]:
salario.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [13]:
salario['BasePay'].mean()

66325.44884050643

In [16]:
salario[salario['EmployeeName'] == 'GARY JIMENEZ']

   Id  EmployeeName  ...         Agency  Status
1   2  GARY JIMENEZ  ...  San Francisco     NaN

[1 rows x 13 columns]

In [17]:
salario.groupby('Year').mean()

            Id       BasePay  OvertimePay  ...  TotalPayBenefits  Notes  Status
Year                                       ...
2011   18080.0  63595.956517  4531.065429  ...      71744.103871    NaN     NaN
2012   54542.5  65436.406857  5023.417824  ...     100553.229232    NaN     NaN
2013   91728.5  69630.030216  5281.641980  ...     101440.519714    NaN     NaN
2014  129593.0  66564.421924  5401.993737  ...     100250.918884    NaN     NaN

[4 rows x 9 columns]

In [18]:
salario['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)